package ru.netology.test;

import lombok.Value;

import java.util.List;
import java.util.Random;

@Value
public class RussianAdminCenters {
    static List<String> adminCenters = List.of("Москва",
            "Санкт-Петербург",
            "Симферополь",
            "Севастополь",
            "Петропавловск-Камчатский",
            "Якутск",
            "Владивосток",
            "Хабаровск",
            "Красноярск",
            "Иркутск",
            "Чита",
            "Улан-Удэ",
            "Горно-Алтайск",
            "Кызыл",
            "Барнаул",
            "Новосибирск",
            "Омск",
            "Томск",
            "Кемерово",
            "Краснодар",
            "Ставрополь",
            "Ростов-на-Дону",
            "Волгоград",
            "Астрахань",
            "Элиста",
            "Майкоп",
            "Нальчик",
            "Владикавказ",
            "Грозный",
            "Махачкала",
            "Пермь",
            "Екатеринбург",
            "Челябинск",
            "Тюмень",
            "Салехард",
            "Ханты-Мансийск",
            "Курган",
            "Уфа",
            "Саранск",
            "Казань",
            "Ижевск",
            "Йошкар-Ола",
            "Чебоксары",
            "Нижний Новгород",
            "Владимир",
            "Кострома",
            "Ярославль",
            "Иваново",
            "Рязань",
            "Тула",
            "Тверь",
            "Смоленск",
            "Калуга",
            "Брянск",
            "Курск",
            "Белгород",
            "Липецк",
            "Воронеж",
            "Орёл",
            "Самара",
            "Ульяновск",
            "Пенза",
            "Вологда",
            "Архангельск",
            "Сыктывкар",
            "Мурманск",
            "Саранск",
            "Москва");
    ;


    public static String cities() {
        Random random = new Random();
        return adminCenters.get(random.nextInt(adminCenters.size()));
    }
}
