package ru.netology.test;
import com.github.javafaker.Faker;
import java.util.List;
import java.util.Random;
public class RussianAdminCenters {
    private final List<String> adminCenters;
    private final Random random;

    public RussianAdminCenters(){
        adminCenters = List.of("Москва",
                "Санкт-Петербург",
                "Симферополь",
                "Севастополь",
                "Петропавловск-Камчатский",
                "Якутск",
                "Владивосток",
                "Хабаровск",
                "Красноярск",
                "Иркутск",
                "Чита",
                "Улан-Удэ",
                "Горно-Алтайск",
                "Кызыл",
                "Барнаул",
                "Новосибирск",
                "Омск",
                "Томск",
                "Кемерово",
                "Краснодар",
                "Ставрополь",
                "Ростов-на-Дону",
                "Волгоград",
                "Астрахань",
                "Элиста",
                "Майкоп",
                "Нальчик",
                "Владикавказ",
                "Грозный",
                "Махачкала",
                "Пермь",
                "Екатеринбург",
                "Челябинск",
                "Тюмень",
                "Салехард",
                "Ханты-Мансийск",
                "Курган",
                "Уфа",
                "Саранск",
                "Казань",
                "Ижевск",
                "Йошкар-Ола",
                "Чебоксары",
                "Нижний Новгород",
                "Владимир",
                "Кострома",
                "Ярославль",
                "Иваново",
                "Рязань",
                "Тула",
                "Тверь",
                "Смоленск",
                "Калуга",
                "Брянск",
                "Курск",
                "Белгород",
                "Липецк",
                "Воронеж",
                "Орёл",
                "Самара",
                "Ульяновск",
                "Пенза",
                "Вологда",
                "Архангельск",
                "Сыктывкар",
                "Мурманск",
                "Саранск",
                "Москва");
        random = new Random();
    }
    public String cities() {
        return adminCenters.get(random.nextInt(adminCenters.size()));
    }
}
